Revit 2027 API
BoundaryConditions.CanCreateLineBoundaryConditions Method
 Checks if the provided host can host a line boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanCreateLineBoundaryConditions(
	Document doc,
	Reference reference,
	bool isConstrainedOnHost,
	Curve curve
)
Public Shared Function CanCreateLineBoundaryConditions (
	doc As Document,
	reference As Reference,
	isConstrainedOnHost As Boolean,
	curve As Curve
) As Boolean
public:
static bool CanCreateLineBoundaryConditions(
	Document^ doc,
	Reference^ reference,
	bool isConstrainedOnHost,
	Curve^ curve
)
static member CanCreateLineBoundaryConditions :
        doc : Document *
        reference : Reference *
        isConstrainedOnHost : bool *
        curve : Curve -> bool
Parameters
doc Document
 The document containing both the host and the boundary conditions.
reference Reference
 A reference to an analytical element.
isConstrainedOnHost Boolean
 A value indicating if the line boundary conditions is constrained on host or not.
curve Curve
 Curve of the boundary conditions. This is taken into account only if isConstrainedOnHost is false.
Return Value
Boolean
 True if a line boundary conditions can be placed on the input host.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace